{
    "past_logs": [{
        "27 november 2021": {"logs": [
            "Added a command to go to the previous track. `previous`",
            "Changed the embed for 8ball",
            "The dedicated requests channel now has a button which supports going to the previous track"
        ]},
        "10 october 2021": {"logs": [
            "Added a tutorial command. `tutorial`",
            "Added the song requester beside the now playing messages",
            "Added a toggle for showing the song requesters beside the now playing messages",
            "Cleaned up internals for queueing music. Everything should feel a bit more optimized now."
        ]},
        "16 november 2021": {"logs": ["Fixed a bug where repeating a queue would persist even after the bot disconnects fro ma voice channel"]},
        "24 november 2021": {"logs": [
            "The `rewind` command has new aliases (`repeat`, `rep`)",
            "The old repeat command has been changed to `loop`. The `loop` slash command has been unaffected."
        ]},
        "29 november 2021": {"logs": [
            "Fixed a bug where you couldn't play any Spotify links in the requests channel.",
            "Fixed being able to interact with buttons in the requests channel if you weren't in the same voice channel as the bot.",
            "Updated the topic in the requests channel. `Stop the track.` is now `Stop the track and clear the queue.`",
            "Added polls. `help polls`"
        ]},
        "21 november 2021": {"logs": [
            "Added new aliases for looping songs. `loop, l`",
            "Updated the help menu. It now features a selection menu for easily going around the categories.",
            "Updated the back-end logic for controlling audio. Listening to, queueing and controlling music should be much smoother now.",
            "Added slash commands for pretty much all music commands. Do `/` and click on Robertify on the left to view all the commands. More slash commands will be added in the future"
        ]},
        "09 october 2021": {"logs": [
            "Added changelogs! Every time something has been updated/implemented into the bot you will now receive changelog messages in your announcement channel.",
            "Added commands to easily set and remove a role as a DJ (`setdj`, `removedj`). You no longer have to configure that using the permissions command.",
            "Added a command for managing **toggles**. Toggles are customizable feature that you can turn on or off. For example, if you don't want the bot to be announcing every time it plays a song, you can run the command `toggle announcements`. Use `help toggles` for more information.",
            "Implemented a new mechanism to allows non-DJ users to force the bot to leave the voice channel. This will only work if the user is the only other user in the channel with the bot.",
            "Fixed an issue where running the `setchannel` command wouldn't actually update the announcement channel."
        ]},
        "01 december 2021": {"logs": [
            "Added a command for viewing the lyrics of the song being played. lyrics",
            "Fixed a bug where playing single Spotify tracks wouldn't queue the accurate track.",
            "Now playing tracks will no longer clutter your announcement channel.",
            "Fixed a bug where YouTube links couldn't be played at all."
        ]},
        "26 november 2021": {"logs": [
            "The bot now pauses when all users have left the voice chat. The music will resume where it left off once someone joins back within it's timeout period.",
            "Added a seek command. `seek`",
            "Added commands to ban/unban users from the bot. For more information you can do `help ban` and `help unban`",
            "Updated the buttons for the queue. It looks a lot cleaner now.",
            "The possibility of slash commands timing out has been mitigated.",
            "Fixed the announcement toggle",
            "Fixed a bug where you could loop the queue without a queue being present, without being in a voice channel and without anything playing.",
            "Added a requests channel. In this channel you can easily control the bot using buttons, view the currently playing song and the first **10** elements of the queue. You can set this command up by using the `setup` command.",
            "Added a shuffle slash command. `/shuffle`",
            "Added an 8ball command. Custom responses can be added. For more information do `help 8ball`."
        ]},
        "28 november 2021": {"logs": [
            "Re-added support for Spotify playlists. Loading Spotify playlists and albums are now 95% faster than before!",
            "Fixed a bug where moving tracks wouldn't update the message in the requests channel.",
            "Fixed a bug where skipping to a track wouldn't update the message in the requests channel.",
            "Fixed a bug where stopping a track wouldn't update the message in the requests channel.",
            "Added caching for tracks. Load times will now be decreased for songs that have been played already."
        ]},
        "19 october 2021": {"logs": ["Added a resume command. (`resume`)"]},
        "23 november 2021": {"logs": [
            "Added a volume command. `volume`",
            "Added a volume indicator in the **Now Playing** menu",
            "Added slash commands for setting and removing a role as a DJ. `/setdj` `/removedj`"
        ]}
    }],
    "current_log": [
        "Reduced the command cooldown from `2 seconds` to `1 second`.",
        "Slowed down the deletion of song queue messages in the request channel.",
        "Permissions can now be **user specific**, meaning that a specific permission can be added to a specific role. Do `help perms` to see the new usages.",
        "Changed the `setdj` and `removedj` commands. They now support adding permissions to specific users. The slash command has also been changed. There are now two commands relating to `setdj` and `removedj` respectively. One regarding a role and the other regarding a user. For more information on how to use the commands do `help setdj` and `help removedj`"
    ]
}